tutorials/steadyStateNaturalConvection4NFFoam/semiAnnulusHybridHeterogeneous/0/alpha_Ag
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha_Ag;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions		[0 0 0 0 0 0 0];

internalField		uniform 0.02;

boundaryField
{
    ".*"
    {
	type		buongiorno4NFFoam;
        name            Ag;
        jo              (0.0);
        ho              (0.0);
        alphao          (0.0);
    }
}
// ************************************************************************* //
